[GraphicalObject]
Name=vwd
Path=diagtop
; RC-DLL=diaggui.dll
PosStyle=VARIABLE
WndStyle=
x= 0
y= 0
width=510
height= 220
Set0="BMP.dgvwd|dgChangeDiagHelpIndex INSTPANEL| "
Rc-DLL=hpleo008.dll

[ToolDescriptor]
1=gototop   ,  PUSHBUTTON ,hpgbut02.dll
2=logbook   ,  IMAGESET   ,hpgbut02.dll
3=temp      ,  IMAGESET   ,hpgbut02.dll
4=method    ,  IMAGESET   ,hpgbut02.dll
5=lamp      ,  IMAGESET   ,hpgbut02.dll
6=smpldiode ,  IMAGESET   ,hpgbut02.dll
7=refdiode  ,  IMAGESET   ,hpgbut02.dll
8=prep      ,  PUSHBUTTON ,hpgbut02.dll
; 8=filter    ,  IMAGESET   ,hpgbut02.dll
; 9=grating   ,  IMAGESET   ,hpgbut02.dll


[PUSHBUTTON gototop]
x=4
y=4
width=50
height=43
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList=BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top|BMP...\..\LC\800\dggo2top
Command=dgGotoTopLevel vwd
Help=機器パネルのトップレベルへの切替


[IMAGESET logbook]
x=455
y=9
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|BMP...\..\LC\800\dglogbk1|@view.floatingmenu "DiagGuiReg[4]", "VWDlogbook"|可変波長検出器ログブック
set1= BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|BMP...\..\LC\800\dglogbk2|@view.floatingmenu "DiagGuiReg[4]", "VWDlogbook"|可変波長検出器ログブック
Cursor= CUR...\..\LC\800\HAND1
Help=""


[IMAGESET temp]
x=455
y=109
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|BMP...\..\LC\800\dgtemp01|@view.floatingmenu "DiagGuiReg[4]", "VWDtemp"|可変波長検出器温度
set1= BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|BMP...\..\LC\800\dgtemp02|@view.floatingmenu "DiagGuiReg[4]", "VWDtemp"|可変波長検出器温度
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET method]
x=455
y=59
width=40
height=40
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|BMP...\..\LC\800\dgmethd1|@view.floatingmenu "DiagGuiReg[4]", "VWDmethod"|可変波長検出器メソッド
set1= BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|BMP...\..\LC\800\dgmethd2|@view.floatingmenu "DiagGuiReg[4]", "VWDmethod"|可変波長検出器メソッド
Cursor= CUR...\..\LC\800\HAND1
Help=""

[IMAGESET lamp]
x=82
y=6
width=39
height=58
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dglmp1|BMP.dglmp1|BMP.dglmp1|@view.floatingmenu "DiagGuiReg[4]", "VWDlamp"|可変波長検出器ランプ
set1= BMP.dglmp2|BMP.dglmp2|BMP.dglmp2|@view.floatingmenu "DiagGuiReg[4]", "VWDlamp"|可変波長検出器ランプ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET smpldiode]
x=148
y=122
width=25
height=48
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgsampl1|BMP.dgsampl1|BMP.dgsampl1|@view.floatingmenu "DiagGuiReg[4]", "VWDsmpldiode"|可変波長検出器サンプル ダイオード
set1= BMP.dgsampl2|BMP.dgsampl2|BMP.dgsampl2|@view.floatingmenu "DiagGuiReg[4]", "VWDsmpldiode"|可変波長検出器サンプル ダイオード
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET refdiode]
x=338
y=181
width=40
height=37
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgref1|BMP.dgref1|BMP.dgref1|@view.floatingmenu "DiagGuiReg[4]", "VWDrefdiode"|可変波長検出器リファレンス ダイオード
set1= BMP.dgref2|BMP.dgref2|BMP.dgref2|@view.floatingmenu "DiagGuiReg[4]", "VWDrefdiode"|可変波長検出器リファレンス ダイオード
Cursor= CUR...\..\LC\800\HAND1
Help=

[PUSHBUTTON prep]
x=425
y=10
width=15
height=15
State=0
Enable=1
FrameThickness=1
SetIndex=0
ImageList= RBMP.balance|RBMP.balance|RBMP.balance_gray
Command=dgVWDTurnOnOrBalance
Help=クリックで、バランスをかけるかランプをオンにします。

[IMAGESET filter]
x=171
y=46
width=28
height=54
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dgvwfil1|BMP.dgvwfil1|BMP.dgvwfil1|@view.floatingmenu "DiagGuiReg[4]", "VWDfilter"|可変波長検出器フィルタ アセンブリ
set1= BMP.dgvwfil2|BMP.dgvwfil2|BMP.dgvwfil2|@view.floatingmenu "DiagGuiReg[4]", "VWDfilter"|可変波長検出器フィルタ アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=

[IMAGESET grating]
x=289
y=53
width=19
height=65
State=0
Enable=1
FrameThickness=0
SetIndex=0
set0= BMP.dggrat01|BMP.dggrat01|BMP.dggrat01|@view.floatingmenu "DiagGuiReg[4]", "VWDgrating"|可変波長検出器グレーティング アセンブリ
set1= BMP.dggrat02|BMP.dggrat02|BMP.dggrat02|@view.floatingmenu "DiagGuiReg[4]", "VWDgrating"|可変波長検出器グレーティング アセンブリ
Cursor= CUR...\..\LC\800\HAND1
Help=

